'''
스토리 : 단서를 찾아서!

라이캣에 감동받은 개리는 라이캣에게 함께하고 싶다고 말하였습니다. 그리하여 라이캣, 자바독, 개리는 동료가 되어 함께 제주에 도착하여 단서를 찾기 시작했습니다. 하지만 단서를 찾는 것은 막막하기만 했어요. 제주 끝에서 끝까지는 말을 타고 하루를 달려야 할 만큼 먼 거리였거든요.

> 파이와 썬이 이곳에 와서 무슨 생각을 했을까냥?

> 어떤 단서를, 어디다 두어야 할지 고민했겠지. 개굴!

> 만약 내가 파이와 썬이라면, 누구나 '어쩌다' 찾을 수 있는 곳에는 단서를 놓지 않았을 것 같다냥.

자바독이 말했습니다.

> 우리가 가진 단서있독! 알고리즘, 보물, 파이, 썬 그리고 제주가 있독!

라이캣과 자바독과 개리는 가지고 있는 단서를 가지고 제주와 연관시킬 수 있는 곳이 어디있는지 고민해보았습니다.

> 제주가 가진 보물은 무엇이 있을까냥? 제주와 보물, 제주와 파이, 제주와 썬.

라이캣은 무언가 생각났는지 지나가던 행인을 붙잡고 물었어요.

> 제주에 300개 정도 있는 것, 제주에 보물이라 할만한 것은 무엇이 있을까냥?

행인이 대답해주었어요.

> 뜬금? 오름이 있수다. 산과 비슷하지만 몇 걸음만 올라가면 되는 동산이지예.

> 거기서 1000걸음 정도에 올라갈 수 있는 오름은 어디가 있냥?

> 뜬금? 용눈이오름이나, 다랑쉬오름이나, 따라비오름이나 아부오름이 1000걸음이면 올라갈 수 있수다.

라이캣은 오름으로 가자고 했어요. 파이는 수학으로 3.14(π). 제주가 가지고 있는 314개의 보물, 그 중에서도 314m의 고도를 가지고 있는 곳, 그곳에 단서가 있을 것이라 생각하기 때문이에요. 용눈이오름, 다랑쉬오름, 따라비오름을 모두 아침부터 저녁까지 수색하였고, 이제 언급된 오름 중 마지막 오름인 아부오름으로 향했습니다.

아부 오름은 중간이 움푹 파여있는 원형 형태였고, 파여 있는 넓직한 공간에는 나무가 바위들을 호위하듯이 원을 그리며 자라나 있었습니다. 단서는 어디에도 보이지 않았어요.

> 라이캣, 처음부터 다시하는 어떤독?

> 아마도 네가 틀린 것 같다 개굴.

동료들은 지쳤고, 라이캣은 실망했습니다. 하지만 라이캣은 여기가 확실하다는 강한 직감에 사로잡혔어요.

> 아니다냥. 여기서 좀 더 찾아보자냥. 하루만, 하루만 더 찾아보자냥.

밤새 동료들은 단서를 찾아보았지만, 단서는 발견되지 않았어요. 라이캣은 뜨는 해를 바라보며, 되뇌여 보았습니다.

> 내가, 파이와 썬이었다면냥.

라이캣이 상념에 사로잡혀 있을 때! 떠오르는 태양이 산 중간에 있는 바위에 그림자를 만들어 냈고, 그 그림자를 멍하니 바라보던 라이캣은 갑자기 일어섰습니다.

> 모두 이리로 냥! 단서를 찾았다냥!
'''
